samples/soap/phpsoap/req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.otrs.org/TicketConnector/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:TicketCreate><ns1:UserLogin xsi:type="xsd:string">fabio.fazio</ns1:UserLogin><ns1:Password xsi:type="xsd:string">aaAA11!!</ns1:Password><Ticket xsi:type="ns2:Map"><item><key xsi:type="xsd:string">Title</key><value xsi:type="xsd:string">some title</value></item><item><key xsi:type="xsd:string">CustomerUser</key><value xsi:type="xsd:string">fmfazio@gmail.com</value></item><item><key xsi:type="xsd:string">Queue</key><value xsi:type="xsd:string">ZTAC Incoming Queue</value></item><item><key xsi:type="xsd:string">Type</key><value xsi:type="xsd:string">default</value></item><item><key xsi:type="xsd:string">State</key><value xsi:type="xsd:string">new</value></item><item><key xsi:type="xsd:string">Priority</key><value xsi:type="xsd:string">1 very low</value></item></Ticket><Article xsi:type="ns2:Map"><item><key xsi:type="xsd:string">Subject</key><value xsi:type="xsd:string">some subject</value></item><item><key xsi:type="xsd:string">Body</key><value xsi:type="xsd:string">some body</value></item><item><key xsi:type="xsd:string">ContentType</key><value xsi:type="xsd:string">text/plain; charset=utf8</value></item></Article></ns1:TicketCreate></SOAP-ENV:Body></SOAP-ENV:Envelope>


